results/run-stages.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: stages.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 001/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 001/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 002/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 002/100 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 002/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 002/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 002/100 VUs, 5 complete and 0 interrupted iterations
default   [  12% ] 002/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 003/100 VUs, 7 complete and 0 interrupted iterations
default   [  13% ] 003/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [  15% ] 003/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 003/100 VUs, 12 complete and 0 interrupted iterations
default   [  17% ] 003/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 003/100 VUs, 13 complete and 0 interrupted iterations
default   [  18% ] 003/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 004/100 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 004/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 004/100 VUs, 18 complete and 0 interrupted iterations
default   [  22% ] 004/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 004/100 VUs, 22 complete and 0 interrupted iterations
default   [  23% ] 004/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 004/100 VUs, 25 complete and 0 interrupted iterations
default   [  25% ] 004/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 006/100 VUs, 28 complete and 0 interrupted iterations
default   [  27% ] 006/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 008/100 VUs, 31 complete and 0 interrupted iterations
default   [  28% ] 008/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 009/100 VUs, 36 complete and 0 interrupted iterations
default   [  30% ] 009/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 011/100 VUs, 43 complete and 0 interrupted iterations
default   [  32% ] 011/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 013/100 VUs, 51 complete and 0 interrupted iterations
default   [  33% ] 013/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 014/100 VUs, 59 complete and 0 interrupted iterations
default   [  35% ] 014/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 016/100 VUs, 71 complete and 0 interrupted iterations
default   [  37% ] 016/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 018/100 VUs, 82 complete and 0 interrupted iterations
default   [  38% ] 018/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 019/100 VUs, 95 complete and 0 interrupted iterations
default   [  40% ] 019/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 021/100 VUs, 109 complete and 0 interrupted iterations
default   [  42% ] 021/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 023/100 VUs, 124 complete and 0 interrupted iterations
default   [  43% ] 023/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 024/100 VUs, 141 complete and 0 interrupted iterations
default   [  45% ] 024/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 026/100 VUs, 159 complete and 0 interrupted iterations
default   [  47% ] 026/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 028/100 VUs, 180 complete and 0 interrupted iterations
default   [  48% ] 028/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 029/100 VUs, 198 complete and 0 interrupted iterations
default   [  50% ] 029/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 034/100 VUs, 222 complete and 0 interrupted iterations
default   [  52% ] 034/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 039/100 VUs, 243 complete and 0 interrupted iterations
default   [  53% ] 039/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 043/100 VUs, 273 complete and 0 interrupted iterations
default   [  55% ] 043/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 048/100 VUs, 303 complete and 0 interrupted iterations
default   [  57% ] 048/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 053/100 VUs, 338 complete and 0 interrupted iterations
default   [  58% ] 053/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 057/100 VUs, 378 complete and 0 interrupted iterations
default   [  60% ] 057/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 062/100 VUs, 417 complete and 0 interrupted iterations
default   [  62% ] 062/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 067/100 VUs, 462 complete and 0 interrupted iterations
default   [  63% ] 067/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 071/100 VUs, 513 complete and 0 interrupted iterations
default   [  65% ] 071/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 076/100 VUs, 565 complete and 0 interrupted iterations
default   [  67% ] 076/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 081/100 VUs, 622 complete and 0 interrupted iterations
default   [  68% ] 081/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 085/100 VUs, 685 complete and 0 interrupted iterations
default   [  70% ] 085/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 090/100 VUs, 743 complete and 0 interrupted iterations
default   [  72% ] 090/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 095/100 VUs, 814 complete and 0 interrupted iterations
default   [  73% ] 095/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 099/100 VUs, 888 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 100/100 VUs, 955 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 091/100 VUs, 1036 complete and 0 interrupted iterations
default   [  78% ] 091/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 084/100 VUs, 1109 complete and 0 interrupted iterations
default   [  80% ] 084/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 079/100 VUs, 1174 complete and 0 interrupted iterations
default   [  82% ] 079/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 071/100 VUs, 1237 complete and 0 interrupted iterations
default   [  83% ] 071/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 065/100 VUs, 1295 complete and 0 interrupted iterations
default   [  85% ] 065/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 058/100 VUs, 1342 complete and 0 interrupted iterations
default   [  87% ] 058/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 051/100 VUs, 1389 complete and 0 interrupted iterations
default   [  88% ] 051/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 046/100 VUs, 1430 complete and 0 interrupted iterations
default   [  90% ] 046/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 039/100 VUs, 1464 complete and 0 interrupted iterations
default   [  92% ] 039/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 032/100 VUs, 1491 complete and 0 interrupted iterations
default   [  93% ] 032/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 026/100 VUs, 1520 complete and 0 interrupted iterations
default   [  95% ] 026/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 019/100 VUs, 1541 complete and 0 interrupted iterations
default   [  97% ] 019/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 011/100 VUs, 1557 complete and 0 interrupted iterations
default   [  98% ] 011/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 004/100 VUs, 1566 complete and 0 interrupted iterations
default   [ 100% ] 004/100 VUs  1m00.0s/1m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<406.08' p(95)=233.15ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1570    25.855618/s
    checks_succeeded...: 100.00% 1570 out of 1570
    checks_failed......: 0.00%   0 out of 1570

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=143.83ms min=54.36ms med=149.67ms max=331.9ms p(90)=230.4ms p(95)=233.15ms
      { expected_response:true }...: avg=143.83ms min=54.36ms med=149.67ms max=331.9ms p(90)=230.4ms p(95)=233.15ms
    http_req_failed................: 0.00%  0 out of 3140
    http_reqs......................: 3140   51.711236/s

    EXECUTION
    iteration_duration.............: avg=1.32s    min=1.27s   med=1.28s    max=2.16s   p(90)=1.31s   p(95)=1.86s   
    iterations.....................: 1570   25.855618/s
    vus............................: 4      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 6.7 MB 110 kB/s
    data_sent......................: 489 kB 8.1 kB/s



running (1m00.7s), 000/100 VUs, 1570 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m0s